f32c/arduino/hardware/fpga/f32c/tools/boards-manager/boards.txt
#
# Xilinx ESA11 Artix-7 board (Emanuel Stiebler)
#
fpga_esa11_7a35i_xram.name=ESA11 (Xilinx Artix-7 XC7A35I, 128K BRAM, 100 MHz)
fpga_esa11_7a35i_xram.build.mcu=f32c
fpga_esa11_7a35i_xram.build.core=f32c
fpga_esa11_7a35i_xram.build.board=F32C_FPGA_ESA11_7A35I_BRAM
fpga_esa11_7a35i_xram.upload.tool=ujprog
fpga_esa11_7a35i_xram.upload.wait_for_upload_port=false
fpga_esa11_7a35i_xram.upload.native_usb=false
fpga_esa11_7a35i_xram.bootloader.openocd.board={runtime.platform.path}/tools/openocd/scripts/board/esa11_7a35i_ms6p.cfg
fpga_esa11_7a35i_xram.bootloader.file.bit={runtime.tools.bootloaders.path}/esa11/esa11_7a35i_{memsupport}_{cpu.arch}_hdmi_{bitstream.fcpu.mhz}mhz.bit
fpga_esa11_7a35i_xram.bootloader.jtag_spi_bridge.bit={runtime.tools.bootloaders.path}/esa11_7a35i/bscan_xc7a_fgg484_blink.bit
fpga_esa11_7a35i_xram.bootloader.openocd.command=svf -tap chip.tap {{bootloader.file.svf}}
fpga_esa11_7a35i_xram.menu.cpu.mips=MIPS
fpga_esa11_7a35i_xram.menu.cpu.mips.cpu.arch=mips
fpga_esa11_7a35i_xram.menu.cpu.mips.compiler.c.flags={f32c.mips.compiler.c.flags}
fpga_esa11_7a35i_xram.menu.cpu.mips.compiler.cpp.flags={f32c.mips.compiler.cpp.flags}
fpga_esa11_7a35i_xram.menu.cpu.mips.compiler.ld.flags={f32c.mips.compiler.ld.flags}
fpga_esa11_7a35i_xram.menu.cpu.riscv=RISC-V
fpga_esa11_7a35i_xram.menu.cpu.riscv.cpu.arch=riscv
fpga_esa11_7a35i_xram.menu.cpu.riscv.compiler.c.flags={f32c.riscv.compiler.c.flags}
fpga_esa11_7a35i_xram.menu.cpu.riscv.compiler.cpp.flags={f32c.riscv.compiler.cpp.flags}
fpga_esa11_7a35i_xram.menu.cpu.riscv.compiler.ld.flags={f32c.riscv.compiler.ld.flags}
fpga_esa11_7a35i_xram.menu.ramsize.128=128 KB BRAM Emulated external
fpga_esa11_7a35i_xram.menu.ramsize.128.upload.maximum_size=129536
fpga_esa11_7a35i_xram.menu.ramsize.128.build.sdata.size=4096
fpga_esa11_7a35i_xram.menu.ramsize.128.compiler.ld.extra_flags=--section-start=.init=0x80000000
fpga_esa11_7a35i_xram.menu.ramsize.128.memsupport=bram
fpga_esa11_7a35i_xram.menu.ramsize.16=16 KB BRAM Internal
fpga_esa11_7a35i_xram.menu.ramsize.16.upload.maximum_size=14848
fpga_esa11_7a35i_xram.menu.ramsize.16.compiler.ld.extra_flags=--section-start=.init=0x400
fpga_esa11_7a35i_xram.menu.ramsize.16.memsupport=bram
fpga_esa11_7a35i_xram.menu.speed.100=100 MHz
fpga_esa11_7a35i_xram.menu.speed.100.build.f_cpu=100000000
fpga_esa11_7a35i_xram.menu.speed.100.bitstream.fcpu.mhz=100
fpga_esa11_7a35i_xram.menu.protocol.bin=Binary 115.2 kbit/s CRC RS232
fpga_esa11_7a35i_xram.menu.protocol.bin.upload.protocol=bin
fpga_esa11_7a35i_xram.menu.protocol.bin.upload.flags=-P{serial.port} -re
fpga_esa11_7a35i_xram.menu.protocol.hex=Hex 115.2 kbit/s no verify RS232
fpga_esa11_7a35i_xram.menu.protocol.hex.upload.protocol=hex
fpga_esa11_7a35i_xram.menu.protocol.hex.upload.flags=-P{serial.port} -ra
fpga_esa11_7a35i_xram.menu.pinmap.generic=Generic
fpga_esa11_7a35i_xram.menu.pinmap.generic.build.variant=generic
fpga_esa11_7a35i_xram.menu.pinmap.esa11=ESA11
fpga_esa11_7a35i_xram.menu.pinmap.esa11.build.variant=esa11
fpga_esa11_7a35i_xram.menu.jtag.ft2232=Onboard FT4232 JTAG
fpga_esa11_7a35i_xram.menu.jtag.ft2232.bootloader.openocd.interface={runtime.platform.path}/tools/openocd/scripts/interface/ftdi/ft4232-generic.ocd
fpga_esa11_7a35i_xram.menu.bitstream.sram_xc3sprog=SRAM xc3sprog (temporary)
fpga_esa11_7a35i_xram.menu.bitstream.sram_xc3sprog.upload.bitstream.command="{runtime.tools.xc3sprog.path}/xc3sprog" -c ft4232h_fast "{bootloader.file.bit}"
fpga_esa11_7a35i_xram.menu.bitstream.sram_xc3sprog.upload.bitstream.command.windows="{runtime.tools.xc3sprog.path}/xc3sprog.bat" -c ft4232h_fast "{bootloader.file.bit}"

#
# Lattice FleaFPGA-Uno (Fleasystems Lattice MachXO2-7000HC)
# http://www.fleasystems.com
#
fpga_fleafpga_uno.name=FleaFPGA-Uno (Lattice MachXO2-7000HC)
fpga_fleafpga_uno.build.board=F32C_FPGA_FLEAFPGA_UNO
fpga_fleafpga_uno.build.f_cpu=50000000
fpga_fleafpga_uno.build.variant=generic
fpga_fleafpga_uno.build.mcu=f32c
fpga_fleafpga_uno.build.core=f32c
fpga_fleafpga_uno.upload.tool=ujprog
fpga_fleafpga_uno.upload.wait_for_upload_port=false
fpga_fleafpga_uno.upload.native_usb=false
fpga_fleafpga_uno.upload.maximum_size=491520
fpga_fleafpga_uno.upload.bitstream.command="{runtime.tools.FleaFPGA-JTAG.path}/FleaFPGA-JTAG" "{bootloader.file.vme}"
fpga_fleafpga_uno.bootloader.file.vme={runtime.tools.bootloaders.path}/FleaFPGA-Uno/FleaFPGA-Uno_{cpu.arch}_{bitstream_target}_{socopt}_{f_cpu_MHz}mhz.vme
fpga_fleafpga_uno.menu.cpu.mips=MIPS
fpga_fleafpga_uno.menu.cpu.mips.cpu.arch=mips
fpga_fleafpga_uno.menu.cpu.mips.compiler.c.flags={f32c.mips.compiler.c.flags}
fpga_fleafpga_uno.menu.cpu.mips.compiler.cpp.flags={f32c.mips.compiler.cpp.flags}
fpga_fleafpga_uno.menu.cpu.mips.compiler.ld.flags={f32c.mips.compiler.ld.flags}
fpga_fleafpga_uno.menu.cpu.riscv=RISC-V
fpga_fleafpga_uno.menu.cpu.riscv.cpu.arch=riscv
fpga_fleafpga_uno.menu.cpu.riscv.compiler.c.flags={f32c.riscv.compiler.c.flags}
fpga_fleafpga_uno.menu.cpu.riscv.compiler.cpp.flags={f32c.riscv.compiler.cpp.flags}
fpga_fleafpga_uno.menu.cpu.riscv.compiler.ld.flags={f32c.riscv.compiler.ld.flags}
fpga_fleafpga_uno.menu.ramsize.512K=512KB SRAM Onboard
fpga_fleafpga_uno.menu.ramsize.512K.upload.maximum_size=491520
fpga_fleafpga_uno.menu.ramsize.512K.build.sdata.size=4096
fpga_fleafpga_uno.menu.ramsize.512K.compiler.ld.extra_flags=--section-start=.init=0x80000000
fpga_fleafpga_uno.menu.ramsize.16K=16KB BRAM Internal
fpga_fleafpga_uno.menu.ramsize.16K.upload.maximum_size=14900
fpga_fleafpga_uno.menu.ramsize.16K.build.sdata.size=32768
fpga_fleafpga_uno.menu.ramsize.16K.compiler.ld.extra_flags=--section-start=.init=0x400
fpga_fleafpga_uno.menu.soc.vgatxt80x30=Video text 80x30+640x480 (HDMI, 50 MHz)
fpga_fleafpga_uno.menu.soc.vgatxt80x30.socopt=vgatxt80x30
fpga_fleafpga_uno.menu.soc.vgatxt80x30.build.f_cpu=50000000
fpga_fleafpga_uno.menu.soc.vgatxt80x30.f_cpu_MHz=50
fpga_fleafpga_uno.menu.soc.vgatxt80x60=Video text 80x60+640x480 (HDMI, 50 MHz)
fpga_fleafpga_uno.menu.soc.vgatxt80x60.socopt=vgatxt80x60
fpga_fleafpga_uno.menu.soc.vgatxt80x60.build.f_cpu=50000000
fpga_fleafpga_uno.menu.soc.vgatxt80x60.f_cpu_MHz=50
fpga_fleafpga_uno.menu.bitstream.sram=SRAM (temporary)
fpga_fleafpga_uno.menu.bitstream.sram.bitstream_target=sram
fpga_fleafpga_uno.menu.bitstream.flash=FLASH (permanent)
fpga_fleafpga_uno.menu.bitstream.flash.bitstream_target=flash
fpga_fleafpga_uno.menu.protocol.bin=Binary 115.2 kbit/s CRC RS232
fpga_fleafpga_uno.menu.protocol.bin.upload.protocol=bin
fpga_fleafpga_uno.menu.protocol.bin.upload.flags=-P{serial.port} -re
fpga_fleafpga_uno.menu.protocol.hex=Hex 115.2 kbit/s no verify RS232
fpga_fleafpga_uno.menu.protocol.hex.upload.protocol=hex
fpga_fleafpga_uno.menu.protocol.hex.upload.flags=-P{serial.port} -ra
fpga_fleafpga_uno.menu.pinmap.FleaFPGA-Uno=FleaFPGA-Uno board
fpga_fleafpga_uno.menu.pinmap.FleaFPGA-Uno.build.variant=FleaFPGA-Uno
fpga_fleafpga_uno.menu.pinmap.generic=generic
fpga_fleafpga_uno.menu.pinmap.generic.build.variant=generic

#
# Xilinx Posedge-One Spartan-6
#
fpga_Posedge_One_bram.name=Posedge-One (Xilinx Spartan-6 XC6SLX9, 32K BRAM, 100 MHz)
fpga_Posedge_One_bram.build.mcu=f32c
fpga_Posedge_One_bram.build.core=f32c
fpga_Posedge_One_bram.build.board=F32C_FPGA_POSEDGEONE_BRAM
fpga_Posedge_One_bram.upload.tool=ujprog
fpga_Posedge_One_bram.upload.wait_for_upload_port=false
fpga_Posedge_One_bram.upload.native_usb=false
fpga_Posedge_One_bram.menu.cpu.mips=MIPS
fpga_Posedge_One_bram.menu.cpu.mips.cpu.arch=mips
fpga_Posedge_One_bram.menu.cpu.mips.compiler.c.flags={f32c.mips.compiler.c.flags}
fpga_Posedge_One_bram.menu.cpu.mips.compiler.cpp.flags={f32c.mips.compiler.cpp.flags}
fpga_Posedge_One_bram.menu.cpu.mips.compiler.ld.flags={f32c.mips.compiler.ld.flags}
fpga_Posedge_One_bram.menu.cpu.riscv=RISC-V
fpga_Posedge_One_bram.menu.cpu.riscv.cpu.arch=riscv
fpga_Posedge_One_bram.menu.cpu.riscv.compiler.c.flags={f32c.riscv.compiler.c.flags}
fpga_Posedge_One_bram.menu.cpu.riscv.compiler.cpp.flags={f32c.riscv.compiler.cpp.flags}
fpga_Posedge_One_bram.menu.cpu.riscv.compiler.ld.flags={f32c.riscv.compiler.ld.flags}
fpga_Posedge_One_bram.menu.ramsize.32=32 KB BRAM Internal
fpga_Posedge_One_bram.menu.ramsize.32.upload.maximum_size=31232
fpga_Posedge_One_bram.menu.ramsize.32.compiler.ld.extra_flags=--section-start=.init=0x400
fpga_Posedge_One_bram.menu.speed.100=100 MHz
fpga_Posedge_One_bram.menu.speed.100.build.f_cpu=100000000
fpga_Posedge_One_bram.menu.speed.100.bitstream.fcpu.mhz=100
fpga_Posedge_One_bram.menu.soc.normal=Normal (24 GPIO, SPI, FM/RDS, VGA_text)
fpga_Posedge_One_bram.menu.soc.normal.socopt=normal
fpga_Posedge_One_bram.menu.soc.logix1=logix1 (logix1 megawing peripherals)
fpga_Posedge_One_bram.menu.soc.logix1.socopt=logix1
fpga_Posedge_One_bram.menu.protocol.bin=Binary 115.2 kbit/s CRC RS232
fpga_Posedge_One_bram.menu.protocol.bin.upload.protocol=bin
fpga_Posedge_One_bram.menu.protocol.bin.upload.flags=-P{serial.port} -re
fpga_Posedge_One_bram.menu.protocol.hex=Hex 115.2 kbit/s no verify RS232
fpga_Posedge_One_bram.menu.protocol.hex.upload.protocol=hex
fpga_Posedge_One_bram.menu.protocol.hex.upload.flags=-P{serial.port} -ra
fpga_Posedge_One_bram.menu.pinmap.generic=Generic
fpga_Posedge_One_bram.menu.pinmap.generic.build.variant=generic
fpga_Posedge_One_bram.upload.bitstream.command="{runtime.tools.xc3sprog.path}/xc3sprog" -c ftdi_fast "{bootloader.file.bit}"
fpga_Posedge_One_bram.upload.bitstream.command.windows="{runtime.tools.xc3sprog.path}/xc3sprog.bat" -L -c ftdi_fast "{bootloader.file.bit}"
fpga_Posedge_One_bram.bootloader.file.bit={runtime.tools.bootloaders.path}/posedge1/posedgeone_bram_{socopt}_{cpu.arch}_{bitstream.fcpu.mhz}mhz.bit

#
# FPGArduino Generic f32c SoC
#
fpga_generic.name=Generic FPGA board
fpga_generic.build.mcu=f32c
fpga_generic.build.core=f32c
fpga_generic.build.board=F32C_FPGA_GENERIC
fpga_generic.upload.tool=ujprog
fpga_generic.upload.wait_for_upload_port=false
fpga_generic.upload.native_usb=false
fpga_generic.menu.cpu.mips=MIPS
fpga_generic.menu.cpu.mips.cpu.arch=mips
fpga_generic.menu.cpu.mips.compiler.c.flags={f32c.mips.compiler.c.flags}
fpga_generic.menu.cpu.mips.compiler.cpp.flags={f32c.mips.compiler.cpp.flags}
fpga_generic.menu.cpu.mips.compiler.ld.flags={f32c.mips.compiler.ld.flags}
fpga_generic.menu.cpu.riscv=RISC-V
fpga_generic.menu.cpu.riscv.cpu.arch=riscv
fpga_generic.menu.cpu.riscv.compiler.c.flags={f32c.riscv.compiler.c.flags}
fpga_generic.menu.cpu.riscv.compiler.cpp.flags={f32c.riscv.compiler.cpp.flags}
fpga_generic.menu.cpu.riscv.compiler.ld.flags={f32c.riscv.compiler.ld.flags}
fpga_generic.menu.ramsize.8=8 KB BRAM Internal
fpga_generic.menu.ramsize.8.upload.maximum_size=6656
fpga_generic.menu.ramsize.8.build.sdata.size=32768
fpga_generic.menu.ramsize.8.compiler.ld.extra_flags=--section-start=.init=0x400
fpga_generic.menu.ramsize.16=16 KB BRAM Internal
fpga_generic.menu.ramsize.16.upload.maximum_size=14848
fpga_generic.menu.ramsize.16.build.sdata.size=32768
fpga_generic.menu.ramsize.16.compiler.ld.extra_flags=--section-start=.init=0x400
fpga_generic.menu.ramsize.32=32 KB BRAM Internal
fpga_generic.menu.ramsize.32.upload.maximum_size=31232
fpga_generic.menu.ramsize.32.build.sdata.size=32768
fpga_generic.menu.ramsize.32.compiler.ld.extra_flags=--section-start=.init=0x400
fpga_generic.menu.ramsize.64=64 KB BRAM Internal
fpga_generic.menu.ramsize.64.upload.maximum_size=64000
fpga_generic.menu.ramsize.64.build.sdata.size=32768
fpga_generic.menu.ramsize.64.compiler.ld.extra_flags=--section-start=.init=0x400
fpga_generic.menu.ramsize.128=128 KB BRAM Internal
fpga_generic.menu.ramsize.128.upload.maximum_size=129536
fpga_generic.menu.ramsize.128.build.sdata.size=4096
fpga_generic.menu.ramsize.128.compiler.ld.extra_flags=--section-start=.init=0x400
fpga_generic.menu.ramsize.1024=1 MB SRAM Onboard
fpga_generic.menu.ramsize.1024.upload.maximum_size=1015808
fpga_generic.menu.ramsize.1024.build.sdata.size=4096
fpga_generic.menu.ramsize.1024.compiler.ld.extra_flags=--section-start=.init=0x80000000
fpga_generic.menu.speed.10=10 MHz
fpga_generic.menu.speed.10.build.f_cpu=10000000
fpga_generic.menu.speed.20=20 MHz
fpga_generic.menu.speed.20.build.f_cpu=20000000
fpga_generic.menu.speed.25=25 MHz
fpga_generic.menu.speed.25.build.f_cpu=25000000
fpga_generic.menu.speed.30=30 MHz
fpga_generic.menu.speed.30.build.f_cpu=30000000
fpga_generic.menu.speed.33=33.3 MHz
fpga_generic.menu.speed.33.build.f_cpu=33333333
fpga_generic.menu.speed.40=40 MHz
fpga_generic.menu.speed.40.build.f_cpu=40000000
fpga_generic.menu.speed.50=50 MHz
fpga_generic.menu.speed.50.build.f_cpu=50000000
fpga_generic.menu.speed.60=60 MHz
fpga_generic.menu.speed.60.build.f_cpu=60000000
fpga_generic.menu.speed.66=66.6 MHz
fpga_generic.menu.speed.66.build.f_cpu=66666666
fpga_generic.menu.speed.70=70 MHz
fpga_generic.menu.speed.70.build.f_cpu=70000000
fpga_generic.menu.speed.75=75 MHz
fpga_generic.menu.speed.75.build.f_cpu=75000000
fpga_generic.menu.speed.80=80 MHz
fpga_generic.menu.speed.80.build.f_cpu=80000000
fpga_generic.menu.speed.81=81.25 MHz
fpga_generic.menu.speed.81.build.f_cpu=81250000
fpga_generic.menu.speed.90=90 MHz
fpga_generic.menu.speed.90.build.f_cpu=90000000
fpga_generic.menu.speed.100=100 MHz
fpga_generic.menu.speed.100.build.f_cpu=100000000
fpga_generic.menu.speed.112=112.5 MHz
fpga_generic.menu.speed.112.build.f_cpu=112500000
fpga_generic.menu.speed.125=125 MHz
fpga_generic.menu.speed.125.build.f_cpu=125000000
fpga_generic.menu.speed.133=133.3 MHz
fpga_generic.menu.speed.133.build.f_cpu=133333333
fpga_generic.menu.speed.150=150 MHz
fpga_generic.menu.speed.150.build.f_cpu=150000000
fpga_generic.menu.speed.166=166.6 MHz
fpga_generic.menu.speed.166.build.f_cpu=166666666
fpga_generic.menu.protocol.hex=Hex 115.2 kbit/s no verify RS232
fpga_generic.menu.protocol.hex.upload.protocol=hex
fpga_generic.menu.protocol.hex.upload.flags=-P{serial.port} -ra
fpga_generic.menu.protocol.bin=Binary 115.2 kbit/s CRC RS232
fpga_generic.menu.protocol.bin.upload.protocol=bin
fpga_generic.menu.protocol.bin.upload.flags=-P{serial.port} -re
fpga_generic.menu.protocol.binftdi=Binary 3 Mbit/s CRC FTDI
fpga_generic.menu.protocol.binftdi.upload.protocol=bin
fpga_generic.menu.protocol.binftdi.upload.flags=-re
fpga_generic.menu.pinmap.generic=Generic
fpga_generic.menu.pinmap.generic.build.variant=generic
fpga_generic.menu.pinmap.ulx2s_physical=ULX2S Physical
fpga_generic.menu.pinmap.ulx2s_physical.build.variant=ulx2s_physical
